""" 3가지 키워드로 정리하는 핵심포인트
● 컴퓨터 프로그래밍이란 컴퓨터가 무엇을 해야 할지 미리 작성한 진행 계획을 말합니다.
● 소스코드는 프로그래밍 언어로 사람이 쉽게 읽고 이해할 수 있도록 만든 코드입니다.
● 파이썬은 ① 배우기 쉽습니다. ② 다양한 분야에서 활용됩니다. ③ 대부분의 운영체제에서 동일하게 사용됩니다."""


#1 커피 마느는 과정
print('#1 커피만드는 과정')
print("전기 포트→ 물→ 커피잔→ 커피믹스→ 티스푼")
print()
print()

#2 용어 설명
print("#2 용어 설명")
print("프로그래밍: 프로그램을 만드는 것 ")
print("프로그램: 미리 작성항 계획")
print("컴퓨터 프로그래밍: 컴퓨터가 무엇을 해야 할지 미리 작성한 진행 계획")
print("프로그래밍 언어: 프로그램을 만들려는 목적으로 사람이 이해하기 쉬운 언어를 이용해 만들어진 언어")
print("소스코드: 프로그래밍 언어로 사람이 쉽게 읽고 이해할 수 있도록 만든 코드")
print("이진코드: 컴퓨터가 이해하는 이진 숫자로 이루어진 코드")
print()
print()

#3 파이썬 특장
print("#3 파이썬 특징")
print("① 문법이 간단해서 배우기 쉽다.")
print("② 웹서버, 해킹 도구, IoT, 인공지능 등 다양한 분야에서 활용할 수 있다.")
print("③ 원도우, 맥, 리눅스와 같은 운영체제 마다 사용 방법이 다르다")
print("→ 대부분의 운영체제에서 동일하게 사용된다.")
print("④ 쉽게 사용할 수 있다는 장짐이 있는 대신 느리다.")
