""""5가지 키워드로 정리하는 핵심포인트
● 파이썬을 하려면 파이썬 코드를 입력할 수 있는 텍스트 에디터와 파이썬 코드를 실행할 수 있는 도구인 파이썬 인터프리터가 필요합니다.
● 파이썬은 명령 프롬프트의 >>>에 코드를 입력하면 바로 실행 결과를 볼 수 있는데, 이는 한마디씩 주고받는 것처럼 대화한다고 해서 인터렉티브 셀(대화형 셀)이라고 합니다.
●파이썬으로 작성한 파일은 해당 폴더의 윈도우 파워셸이나 명령 프롬프트에서 python 명령어로 실행할 수 있습니다."""

#1 파이썬 출력
print("#1 파이썬 출력")
print('>>> print("Hello Python")')
print("Hello Python")
print()
print()

#2 파일만들고 출력하기
print("#2 파일만들고 출력하기")
print('print("Hello!"*3)')
print('"print("혼자 공부하다 모르면 동영상 강의를 참고하세요!")')
print('Hello!Hello!Hello!')
print('혼자 공부하다 모르면 동영상 강의를 참고하세요!')
